In [1]:
# import libraries
import pandas as pd
from numpy import random
import matplotlib.pyplot
import sys
import matplotlib

# enable inline plotting
%matplotlib inline

In [2]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)
print('Matplotlib version ' + matplotlib.__version__)

Python version 2.7.13 |Anaconda 4.4.0 (x86_64)| (default, Dec 20 2016, 23:05:08)
[GCC 4.2.1 Compatible Apple LLVM 6.0 (clang-600.0.57)]
Pandas version 0.20.1
Matplotlib version 2.0.2

In [3]:
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']

In [4]:
# ensures random samples always identical
random.seed?

In [5]:
random.randint?

In [6]:
len?

In [7]:
range?

In [8]:
zip?

In [9]:
random.seed(500)
random_names = [names[random.randint(low=0, high=len(names))] for i in range(1000)]

random_names[:10]

['Mary',
 'Jessica',
 'Jessica',
 'Bob',
 'Jessica',
 'Jessica',
 'Jessica',
 'Mary',
 'Mary',
 'Mary']

In [10]:
births = [random.randint(low=0, high=1000) for i in range(1000)]
births[:10]

[968, 155, 77, 578, 973, 124, 155, 403, 199, 191]

In [11]:
BabyDataSet = list(zip(random_names, births))
BabyDataSet[:10]

[('Mary', 968),
 ('Jessica', 155),
 ('Jessica', 77),
 ('Bob', 578),
 ('Jessica', 973),
 ('Jessica', 124),
 ('Jessica', 155),
 ('Mary', 403),
 ('Mary', 199),
 ('Mary', 191)]

In [12]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])
df[:10]

     Names  Births
0     Mary     968
1  Jessica     155
2  Jessica      77
3      Bob     578
4  Jessica     973
5  Jessica     124
6  Jessica     155
7     Mary     403
8     Mary     199
9     Mary     191

In [13]:
df.to_csv?

In [14]:
df.to_csv('births1880.txt', index=False, header=False)

In [15]:
pd.read_csv?

In [16]:
Location = r'/Users/andrewyu/Desktop/development/notebooks-datascience/births1880.txt'
df = pd.read_csv(Location)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 2 columns):
Mary    999 non-null object
968     999 non-null int64
dtypes: int64(1), object(1)
memory usage: 15.7+ KB

In [18]:
df.head()

      Mary  968
0  Jessica  155
1  Jessica   77
2      Bob  578
3  Jessica  973
4  Jessica  124

In [19]:
df = pd.read_csv(Location, header=None)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
0    1000 non-null object
1    1000 non-null int64
dtypes: int64(1), object(1)
memory usage: 15.7+ KB

In [20]:
df.tail()

           0    1
995     John  151
996  Jessica  511
997     John  756
998  Jessica  294
999     John  152

In [21]:
df = pd.read_csv(Location, names=['Names', 'Births'])
df.head(5)

     Names  Births
0     Mary     968
1  Jessica     155
2  Jessica      77
3      Bob     578
4  Jessica     973

In [22]:
import os
os.remove(Location)

In [23]:
#### Prepare Data

df['Names'].unique()

array(['Mary', 'Jessica', 'Bob', 'John', 'Mel'], dtype=object)

In [24]:
for x in df['Names'].unique():
    print(x)

Mary
Jessica
Bob
John
Mel

In [25]:
# Method 2:
print(df['Names'].describe())

count     1000
unique       5
top        Bob
freq       206
Name: Names, dtype: object

In [26]:
df.groupby?

In [27]:
name = df.groupby('Names')

df = name.sum()
df

         Births
Names
Bob      106817
Jessica   97826
John      90705
Mary      99438
Mel      102319